app/controllers/admin/activities_controller.rb

  def index
    @activities = Activity.find(:all)
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)

  def create
    @activity = Activity.new
    @activity.attributes = params[:activity]
    unless @activity.save
---
INSERT INTO `activities` (`name`, `created_at`, `member_id`, `updated_at`, `detail`) VALUES('RDocのテンプレート作成', '2009-06-23 13:12:54', 2, '2009-06-23 13:12:54', 'システムチームで情報共有するために、RDocのテンプレートを作って、情報共有を促進しました。')

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)