app/controllers/admin/members_controller.rb

SELECT * FROM `members` WHERE (`members`.`id` = 1)
---
  def index
    @members = Member.find(:all)

SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
INSERT INTO `members` (`name`, `created_at`, `updated_at`, `role_id`, `received_stars`, `own_stars`) VALUES('根立　宗一郎', '2009-06-23 10:01:13', '2009-06-23 10:01:13', 1, NULL, 50)
---
  def create
    @member = Member.new
    role = Role.find(params[:member][:role_id])

    @member.attributes = params[:member]
    @member.own_stars = role.default_stars || 0
    @member.received_stars = 0

    unless @member.save

SELECT * FROM `members` WHERE (`members`.`id` = 2)
---
  def edit
    @member = Member.find(params[:id])