app/controllers/admin/roles_controller.rb

INSERT INTO `roles` (`name`, `created_at`, `updated_at`, `default_stars`) VALUES('マネージャー', '2009-06-23 09:52:27', '2009-06-23 09:52:27', 50)
---
  def create
    @role = Role.new
    @role.attributes = params[:role]
    unless @role.save

SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
---
  def edit
    @role = Role.find(params[:id])

SELECT * FROM `roles` WHERE (`roles`.`id` = 0)
UPDATE `roles` SET `default_stars` = 25, `updated_at` = '2009-06-23 13:46:23' WHERE `id` = 3
---
  def update
    @role = Role.find(params[:id])
    @role.attributes = params[:role]
    unless @role.update