app/controllers/admin/stars_controller.rb

SELECT * FROM `members` WHERE (`members`.`id` = 2)
UPDATE `members` SET `updated_at` = '2009-06-23 13:35:38', `own_stars` = 49 WHERE `id` = 1
INSERT INTO `stars` (`created_at`, `receiver_id`, `updated_at`, `activity_id`, `sender_id`) VALUES('2009-06-23 13:18:56', 2, '2009-06-23 13:18:56', 1, 1)
---
  def create
    @star = Star.new
    @star.attributes = params[:star]
    sender = Member.find(@star.sender_id)
    sender.own_stars -= 1
    unless sender.save
      message = "データの保存に失敗しました。"
      model_errors(:errors => @sender.errors, :message => message)
      return
    end
    unless @star.save

SELECT * FROM `stars` WHERE (`stars`.`id` = 1)
---
  def edit
    @star = Star.find(params[:id])

SELECT * FROM `stars` WHERE (`stars`.`id` = 1)
DELETE FROM `stars` WHERE `id` = 1
---
  def delete
    @star = Star.find(params[:id])
    unless @star.destroy